CSI API ETABS v1
cFrameObj Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cFrameObj
Public Interface cFrameObj
Dim instance As cFrameObj
public interface class cFrameObj
type cFrameObj =  interface end
The cFrameObj type exposes the following members.
Methods
Name | Description
AddByCoord
 Adds a new frame object whose end points are at the specified coordinates.
AddByPoint
 Adds a new frame object whose end points are specified by name.
ChangeName
Count
Delete
 Deletes frame objects.
DeleteLateralBracing
DeleteLoadDistributed
 Deletes the distributed load assignments to the specified frame objects for the specified load pattern.
DeleteLoadPoint
 Deletes the point load assignments to the specified frame objects for the specified load pattern.
DeleteLoadTemperature
DeleteMass
DeleteModifiers
DeleteSpring
GetAllFrames
 Retrieves select data for all frame objects in the model
GetColumnSpliceOverwrite
 Retrieves the frame object column splice overwrite assignment.
GetCurved_2
 Retrieves frame object curve data
GetDesignOrientation
 Retrieves the design orientation for a given frame object
GetDesignProcedure
 Retrieves the design procedure for a frame object
GetElm
GetEndLengthOffset
 Retrieves the frame object end offsets along the 1-axis of the object.
GetGroupAssign
 Retrieves the groups to which a frame object is assigned.
GetGUID
 Retrieves the GUID for the specified frame object.
GetHingeAssigns
 DEPRECATED Retrieves frame object hinge assignments.
GetHingeAssigns_1
 Retrieves frame object hinge assignments. The assignments include the hinge property, type, and location
GetInsertionPoint
 Retrieves frame object insertion point assignments. The assignments include the cardinal point and end joint offsets.
GetInsertionPoint_1
 Retrieves frame object insertion point assignments. The assignments include the cardinal point and end joint offsets.
GetLabelFromName
 Retrieves the label and story for a unique frame object name
GetLabelNameList
 Retrieves the names and labels of all defined frame objects.
GetLateralBracing
 Retrieves the lateral bracing location assignments for frame objects.
GetLoadDistributed
 Retrieves the distributed load assignments to frame objects.
GetLoadPoint
 Retrieves the point load assignments to frame objects.
GetLoadTemperature
 Retrieves the temperature load assignments to frame objects.
GetLocalAxes
 Retrieves the frame local axis angle assignment for frame objects.
GetMass
GetMaterialOverwrite
GetModifiers
 Retrieves the frame modifier assignment for frame objects. The default value for all modifiers is one.
GetNameFromLabel
 Retrieves the unique name of a frame object, given the label and story level
GetNameList
 Retrieves the names of all defined frame objects.
GetNameListOnStory
 Retrieves the names of the defined frame objects on a given story.
GetOutputStations
 Retrieves frame object output station data
GetPier
 Retrieves the pier label assignments of a frame object
GetPoints
 Retrieves the names of the point objects at each end of a specified frame object.
GetReleases
GetSection
 Retrieves the frame section property assigned to a frame object.
GetSectionNonPrismatic
GetSelected
GetSpandrel
 Retrieves the Spandrel label assignments of a frame object
GetSpringAssignment
 Retrieves the named line spring property assignment for a frame object
GetSupports
 Retrieves support data for a given frame beam object
GetTCLimits
GetTransformationMatrix
GetTypeOAPI
 Retrieves the type of frame object (straight or curved)
SetColumnSpliceOverwrite
 Sets the frame object column splice overwrite assignment.
SetDesignProcedure
 Sets the design procedure for frame objects.
SetEndLengthOffset
 Assigns frame object end offsets along the 1-axis of the object.
SetGroupAssign
 Adds or removes frame objects from a specified group.
SetGUID
 Sets the GUID for the specified frame object. If the GUID is passed in as a blank string, the program automatically creates a GUID for the object.
SetInsertionPoint
 Assigns frame object insertion point data. The assignments include the cardinal point and end joint offsets.
SetInsertionPoint_1
 Assigns frame object insertion point data. The assignments include the cardinal point and end joint offsets.
SetLateralBracing
 Assigns a lateral bracing location to frame objects.
SetLoadDistributed
 Assigns distributed loads to frame objects.
SetLoadPoint
 Assigns point loads to frame objects.
SetLoadTemperature
SetLocalAxes
 Assigns a local axis angle to frame objects.
SetMass
SetMaterialOverwrite
SetModifiers
 Sets the frame modifier assignment for frame objects. The default value for all modifiers is one
SetOutputStations
 Assigns frame object output station data.
SetPier
 Sets the pier label assignment of one or more frame objects
SetReleases
 Makes end release and partial fixity assignments to frame objects.
SetSection
 Assigns a frame section property to a frame object.
SetSelected
 Sets the selected status for a frame object.
SetSpandrel
 Sets the Spandrel label assignment of one or more frame objects
SetSpringAssignment
 Assigns an existing named line spring property to frame objects
SetTCLimits
 Makes tension/compression force limit assignments to frame objects.
Top
See Also
Reference
ETABSv1 Namespace